# Lecture 04: Subqueries, Aggregation

In [6]:
# Run this cell to set up imports
import numpy as np
import pandas as pd

Today's database is a modified version of the Oakland police stops database as made public by the Stanford Open Policing Project: https://openpolicing.stanford.edu/data/ Read more about the database [here](https://openpolicing.stanford.edu/findings/).

If you are looking for how we adjusted the data, contact us and we can share our source notebook.

In [17]:
!psql -h localhost -c 'DROP DATABASE IF EXISTS stops_lecture'
!psql -h localhost -c 'CREATE DATABASE stops_lecture' 
!psql -h localhost -d stops_lecture -f data/stops_lecture.sql

NOTICE:  database "stops_lecture" does not exist, skipping
DROP DATABASE
CREATE DATABASE
SET
SET
SET
SET
SET
 set_config
------------

(1 row)

SET
SET
SET
SET
SET
SET
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
COPY 84779
COPY 211
CREATE INDEX
CREATE INDEX

## `jupysql`

We are going to be using the `jupysql` library to connect our notebook to a PostgreSQL database server on your jupyterhub account. The next cell should do the trick; you should not see any error messages after it completes.

In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [16]:
%sql --close postgresql://127.0.0.1:5432/stops_lecture

In [21]:
%sql postgresql://127.0.0.1:5432/stops_lecture

Connecting and switching to connection postgresql://127.0.0.1:5432/stops_lecture

In [13]:
%%sql
SELECT *
FROM Zips
LIMIT 10;

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

10 rows affected.

+--------+------------------------------------+---------+
| zip_id |              location              | zipcode |
+--------+------------------------------------+---------+
|   0    |                None                |  94546  |
|   1    |            Chabot Park             |  94546  |
|   2    |           Panoramic Hill           |  94563  |
|   3    |                None                |  94577  |
|   4    |          North Stonehurst          |  94577  |
|   5    |          Arrowhead Marsh           |  94601  |
|   6    |              Bartlett              |  94601  |
|   7    |        Coliseum Industrial         |  94601  |
|   8    |              Fairfax               |  94601  |
|   9    | Fairfax Business-Wentworth-Holland |  94601  |
+--------+------------------------------------+---------+
Truncated to displaylimit of 10.

With cell magic (`%%sql`), we can also assign the result to a variable. Try adding `result <<` to the top line of the below cell, i.e., replace the first line with

``%%sql result <<``

In [ ]:
%%sql
SELECT *
FROM Stops
ORDER BY RANDOM()
LIMIT 10;

In [ ]:
result

## Exercise \#1

How do we find the stops that happened in the same location as the stop with ID 123?

In [22]:
%%sql
SELECT *
FROM Stops
WHERE id = 123;

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

1 rows affected.

+-----+----------+--------+------+--------+----------+---------+--------+-----------------+
|  id |   race   |  sex   | age  | arrest | citation | warning | search |     location    |
+-----+----------+--------+------+--------+----------+---------+--------+-----------------+
| 123 | hispanic | female | None | False  |  False   |  False  | False  | Bancroft Avenue |
+-----+----------+--------+------+--------+----------+---------+--------+-----------------+

In [24]:
%%sql
SELECT S1.id, S1.race,
       S1.location
FROM Stops as S1,   -- the "other stops"
     Stops as S2    -- the "stop that refers to ID 123"
WHERE S1.location = S2.location -- the "other stops" must match the ID 123 location
     AND S2.id = 123;

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

444 rows affected.

+-------+----------+-----------------+
|   id  |   race   |     location    |
+-------+----------+-----------------+
|  2720 |  white   | Bancroft Avenue |
|  3097 |  black   | Bancroft Avenue |
|  4715 | hispanic | Bancroft Avenue |
| 12159 |  black   | Bancroft Avenue |
| 80360 | hispanic | Bancroft Avenue |
|  123  | hispanic | Bancroft Avenue |
|  603  |  black   | Bancroft Avenue |
|  928  |  black   | Bancroft Avenue |
|  2857 |  black   | Bancroft Avenue |
|  2914 | hispanic | Bancroft Avenue |
+-------+----------+-----------------+
Truncated to displaylimit of 10.

<br/>

Approach \#2 with CTE:

In [25]:
%%sql
WITH Location123 AS (
    SELECT location
    FROM Stops
    WHERE id = 123
)
SELECT S.id, S.race,
       S.location
FROM Stops as S,
    Location123
WHERE S.location = Location123.location;

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

444 rows affected.

+-------+----------+-----------------+
|   id  |   race   |     location    |
+-------+----------+-----------------+
|  2720 |  white   | Bancroft Avenue |
|  3097 |  black   | Bancroft Avenue |
|  4715 | hispanic | Bancroft Avenue |
| 12159 |  black   | Bancroft Avenue |
| 80360 | hispanic | Bancroft Avenue |
|  123  | hispanic | Bancroft Avenue |
|  603  |  black   | Bancroft Avenue |
|  928  |  black   | Bancroft Avenue |
|  2857 |  black   | Bancroft Avenue |
|  2914 | hispanic | Bancroft Avenue |
+-------+----------+-----------------+
Truncated to displaylimit of 10.

In [29]:
%%sql
WITH Location123 AS (
    SELECT location
    FROM Stops
    WHERE id = 123
) SELECT * FROM Location123;

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

1 rows affected.

+-----------------+
|     location    |
+-----------------+
| Bancroft Avenue |
+-----------------+

<br/>

Approach \#3 with scalar subquery:

In [30]:
%%sql
SELECT S1.id, S1.race, S1.location
FROM Stops S1
WHERE S1.location = (
         SELECT S2.location
         FROM Stops
         S2 WHERE S2.id = 123);

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

444 rows affected.

+-------+----------+-----------------+
|   id  |   race   |     location    |
+-------+----------+-----------------+
|  2720 |  white   | Bancroft Avenue |
|  3097 |  black   | Bancroft Avenue |
|  4715 | hispanic | Bancroft Avenue |
| 12159 |  black   | Bancroft Avenue |
| 80360 | hispanic | Bancroft Avenue |
|  123  | hispanic | Bancroft Avenue |
|  603  |  black   | Bancroft Avenue |
|  928  |  black   | Bancroft Avenue |
|  2857 |  black   | Bancroft Avenue |
|  2914 | hispanic | Bancroft Avenue |
+-------+----------+-----------------+
Truncated to displaylimit of 10.

## `EXISTS` Subquery (and `NOT EXISTS`)

In [ ]:
%%sql
SELECT DISTINCT Stops.location FROM Stops
WHERE NOT EXISTS (
  SELECT * FROM Zips
  WHERE Zips.location = 
          Stops.location);

# Exercise \#2

In [33]:
%%sql
WITH StopZips AS (
    SELECT * FROM Stops NATURAL JOIN Zips
)
SELECT *
FROM StopZips SZ1
WHERE NOT EXISTS (
    -- prove that there is not another id
    -- for the same zipcode
    -- --> i.e., there is an id for the same zipcode
    SELECT *
    FROM StopZips SZ2
    WHERE SZ1.zipcode = SZ2.zipcode -- same zipcode as the table we're looking at
          AND SZ1.id != SZ2.id
);

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

+----------+----+------+-----+-----+--------+----------+---------+--------+--------+---------+
| location | id | race | sex | age | arrest | citation | warning | search | zip_id | zipcode |
+----------+----+------+-----+-----+--------+----------+---------+--------+--------+---------+
+----------+----+------+-----+-----+--------+----------+---------+--------+--------+---------+

Note -- there are no stops that re the only one in their zipcode:

In [35]:
%%sql
SELECT Z1.zipcode, COUNT(*) as count
FROM Stops S1
  NATURAL JOIN Zips Z1
GROUP BY Z1.zipcode
ORDER BY count ASC;

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

15 rows affected.

+---------+-------+
| zipcode | count |
+---------+-------+
|  94621  |   21  |
|  94601  |   43  |
|  94607  |   48  |
|  94705  |   63  |
|  94618  |  126  |
|  94609  |  292  |
|  94608  |  346  |
|  94603  |  435  |
|  94619  |  523  |
|  94612  |  537  |
+---------+-------+
Truncated to displaylimit of 10.

# Exercise \#3

In [ ]:
%%sql
SELECT S1.id, S1.age
FROM Stops S1 
WHERE S1.age >= 
	MAX(S1.age) -- yes, we need to compare to a single value!

In [42]:
%%sql
SELECT S1.id, S1.age
FROM Stops S1 
WHERE S1.age == 
	(SELECT MAX(S2.age)
     FROM Stops S2);

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

RuntimeError: (psycopg2.errors.GroupingError) aggregate functions are not allowed in WHERE
LINE 4:  max(S1.age);
         ^

[SQL: SELECT S1.id, S1.age
FROM Stops S1
WHERE S1.age >=
	max(S1.age);]
(Background on this error at: https://sqlalche.me/e/20/f405)
If you need help solving this issue, send us a message: https://ploomber.io/community

In [49]:
%%sql
SELECT location,
       AVG(age) AS avgage,
       MIN(age) AS minage
FROM Stops
GROUP BY location;

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

144 rows affected.

+-------------------+--------------------+--------+
|      location     |       avgage       | minage |
+-------------------+--------------------+--------+
|        None       | 31.541920731707318 |  13.0  |
|  Thornhill Drive  | 36.42857142857143  |  27.0  |
|   Pendleton Way   |        27.5        |  17.0  |
|   Thermal Street  |        24.0        |  16.0  |
|  Harrison/Oakland | 32.629629629629626 |  18.0  |
|      B Street     | 29.642857142857142 |  17.0  |
| Highland Hospital | 37.333333333333336 |  31.0  |
|    Weld Street    | 30.571428571428573 |  20.0  |
|   Royal Kitchen   |        None        |  None  |
|     Montclair     | 42.01176470588236  |  16.0  |
+-------------------+--------------------+--------+
Truncated to displaylimit of 10.

# Exercise \#4

In [53]:
%%sql
SELECT race, 
AVG (CASE WHEN location = 'West Oakland'
     THEN age
     ELSE NULL
     END
    ) AS west_oakland_avg,
AVG (CASE WHEN location = 'Rockridge'
     THEN age
     ELSE NULL
     END
    ) AS rockridge_Avg 
FROM Stops
GROUP BY race;

Running query in 'postgresql://127.0.0.1:5432/stops_lecture'

5 rows affected.

+------------------------+--------------------+---------------+
|          race          |  west_oakland_avg  | rockridge_avg |
+------------------------+--------------------+---------------+
|         other          | 34.785714285714285 |      55.0     |
|        hispanic        | 30.408333333333335 |      None     |
|         black          | 35.700739744451916 |      None     |
| asian/pacific islander | 32.61290322580645  |      44.5     |
|         white          |     36.734375      |      45.9     |
+------------------------+--------------------+---------------+